tutorials/testPCM/pHT/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    hotWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          42;
        startFace       4274;
    }
    coldWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          42;
        startFace       4316;
    }
    insulatedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          104;
        startFace       4358;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4368;
        startFace       4462;
    }
)

// ************************************************************************* //
