tutorials/testPCM/pHT/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    "p_rgh|p"
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    "(U|k|epsilon|omega|f|v2)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
    }

   
    T
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;   // Tight tolerance is better for PCM
        relTol          0;      // Ensure it reaches the absolute tolerance
    }
	
	p_rghFinal
    {
        $p_rgh;       // Copy settings from p_rgh
        relTol          0; // Ensure it hits the absolute tolerance
    }
    // ---------------------------------------
	"(U|UFinal)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0; // It's best to keep relTol 0 for UFinal
    }

    
    "(T|TFinal)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  3;
    nCorrectors       2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}
relaxationFactors
{
    
    equations
    {
        U               0.8;
        T               0.8; // Lowering this prevents the "hot spots"
    }
}
// ************************************************************************* //
